### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [28]:
# Dependencies and Setup
import pandas as pd

# File to Load 
data_file = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(data_file)

purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [29]:
# Count how many players there are
players_count = len(purchase_data_df["SN"].unique())

players_count

576

In [30]:
# Create Summary table for Total Players
players_summary = pd.DataFrame({"Total Players":[players_count]})

players_summary

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [31]:
# Calculate how many unique items have been purchased
unique_items = len(purchase_data_df["Item ID"].unique())

unique_items

179

In [32]:
# Calculate the average price 
average_price = purchase_data_df["Price"].mean()

average_price

3.050987179487176

In [33]:
# Calculate the total purchases
Total_purchases = len(purchase_data_df["Purchase ID"].unique())

Total_purchases

780

In [34]:
# Calculate the total revenue
Total_Revenue = purchase_data_df["Price"].sum()

Total_Revenue

2379.77

In [35]:
# Create Purchasing Analysis (Total) Summary Table
Purchasing_analysis = pd.DataFrame({"Total of Unique Items": [unique_items], 
                                   "Average Price": average_price,
                                    "Number of Purchases" : Total_purchases,
                                   "Total Revenue": Total_Revenue})

Purchasing_analysis

   Total of Unique Items  Average Price  Number of Purchases  Total Revenue
0                    179       3.050987                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [36]:
# Create a reduced data frame
reduced_df = purchase_data_df[["SN", "Gender"]]

reduced_df

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [37]:
# Drop duplicates from the data frame
reduced_df.drop_duplicates(inplace = True)

gender_count = reduced_df["Gender"].value_counts()

gender_count

<ipython-input-37-89d15144b23c>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  reduced_df.drop_duplicates(inplace = True)

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [38]:
# Calculate the percentage of the gender count
Percent_male = gender_count['Male']/players_count*100
Percent_female = gender_count['Female']/players_count*100
Percent_other = gender_count['Other / Non-Disclosed']/players_count*100

print(Percent_male, Percent_female, Percent_other)

84.02777777777779 14.0625 1.9097222222222223

In [39]:
# Create the Gender Demographics Summary Table
gender_demographics = pd.DataFrame({"":["Male", "Female", "Other / Non-Disclosed"],"Total Count": [gender_count['Male'],gender_count['Female'],gender_count['Other / Non-Disclosed']], 
                                   "Percentage of Players": [Percent_male, Percent_female,Percent_other]})

gender_demographics.set_index("", inplace=True)

gender_demographics

                       Total Count  Percentage of Players

Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [40]:
Gender_Purchase_Total = purchase_data_df.groupby(["Gender"]).sum()["Price"].rename("Total Purchase Value")
Gender_Purchase_Average = purchase_data_df.groupby(["Gender"]).mean()["Price"].rename("Average Purchase Price")
Gender_Purchase_Count = purchase_data_df.groupby(["Gender"]).count()["Price"].rename("Purchase Count")

Avg_Total_PurchasePP =  Gender_Purchase_Total/gender_demographics["Total Count"]

Purchasing_Analysis_Gender = pd.DataFrame({"Purchase Count":Gender_Purchase_Count, 
                                           "Average Purchase Price":Gender_Purchase_Average, 
                                          "Total Purchase Value":Gender_Purchase_Total, 
                                           "Avg Total Purchase per Person": Avg_Total_PurchasePP})


Purchasing_Analysis_Gender["Average Purchase Price"]=Purchasing_Analysis_Gender["Average Purchase Price"].map("${:,.2f}".format)
Purchasing_Analysis_Gender["Total Purchase Value"]=Purchasing_Analysis_Gender["Total Purchase Value"].map("${:,.2f}".format)
Purchasing_Analysis_Gender["Avg Total Purchase per Person"]=Purchasing_Analysis_Gender["Avg Total Purchase per Person"].map("${:,.2f}".format)

Purchasing_Analysis_Gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [41]:
reduced_age_df = purchase_data_df[["SN", "Age"]]

reduced_age_df.drop_duplicates(inplace = True)

reduced_age_df

<ipython-input-41-2183bc3692f6>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  reduced_age_df.drop_duplicates(inplace = True)

                SN  Age
0          Lisim78   20
1      Lisovynya38   40
2       Ithergue48   24
3    Chamassasya86   24
4        Iskosia90   23
..             ...  ...
773         Hala31   21
774     Jiskjask80   11
775     Aethedru70   21
777     Yathecal72   20
778        Sisur91    7

[576 rows x 2 columns]

In [42]:
bins = [0,9.9,14.9,19.9,24.9,29.9,34.9,39.9,100]

group_labels = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
#pd.cut(purchase_data_df["Age"], bins, labels=group_labels)
        
    
group_labels

['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [43]:
pd.cut(reduced_age_df["Age"], bins, labels=group_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [44]:
reduced_age_df["Age Category"] = pd.cut(reduced_age_df["Age"], bins, labels=group_labels, include_lowest=True)
reduced_age_df

<ipython-input-44-4d88b57722c4>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  reduced_age_df["Age Category"] = pd.cut(reduced_age_df["Age"], bins, labels=group_labels, include_lowest=True)

                SN  Age Age Category
0          Lisim78   20        20-24
1      Lisovynya38   40          40+
2       Ithergue48   24        20-24
3    Chamassasya86   24        20-24
4        Iskosia90   23        20-24
..             ...  ...          ...
773         Hala31   21        20-24
774     Jiskjask80   11        10-14
775     Aethedru70   21        20-24
777     Yathecal72   20        20-24
778        Sisur91    7          <10

[576 rows x 3 columns]

In [45]:
Age_count = reduced_age_df["Age Category"].value_counts()


Age_count

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Category, dtype: int64

In [46]:

Percentage_players = Age_count/players_count*100

Percentage_players

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-39     5.381944
10-14     3.819444
<10       2.951389
40+       2.083333
Name: Age Category, dtype: float64

In [47]:
Age_demographics = pd.DataFrame({"Total Count":Age_count,"Percentage of Players":Percentage_players})

Age_demographics["Percentage of Players"]=Age_demographics["Percentage of Players"].map("{:,.2f}%".format)

Age_demographics.sort_index()

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [48]:
pd.cut(purchase_data_df["Age"], bins, labels=group_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [49]:
purchase_data_df["Age Category"] = pd.cut(purchase_data_df["Age"], bins, labels=group_labels, include_lowest=True)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [50]:
Age_purchase_count = purchase_data_df["Age Category"].value_counts()


Age_purchase_count

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
40+       13
Name: Age Category, dtype: int64

In [51]:
Average_Age_PP = purchase_data_df.groupby(["Age Category"]).mean()["Price"]

Average_Age_PP

Age Category
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [52]:
Total_Age_PP = purchase_data_df.groupby(["Age Category"]).sum()["Price"]
Total_Age_PP

Age Category
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [53]:
Avg_Age_TotalP = Total_Age_PP/Age_count
Avg_Age_TotalP

<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [55]:
Purchase_analysis_age = pd.DataFrame({"Purchase Count":Age_purchase_count,
                                      "Average Purchase Price":Average_Age_PP,
                                      "Total Purchase Value":Total_Age_PP,
                                      "Avg Total Purchase per Person":Avg_Age_TotalP})

Purchase_analysis_age["Average Purchase Price"]=Purchase_analysis_age["Average Purchase Price"].map("${:,.2f}".format)
Purchase_analysis_age["Total Purchase Value"]=Purchase_analysis_age["Total Purchase Value"].map("${:,.2f}".format)
Purchase_analysis_age["Avg Total Purchase per Person"]=Purchase_analysis_age["Avg Total Purchase per Person"].map("${:,.2f}".format)

Purchase_analysis_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [61]:
Most_Popular_df = purchase_data_df[["Item ID", "Item Name", "Price"]]
Most_Popular_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [64]:
Most_Popular_count = Most_Popular_df["Item ID"].value_counts()

Most_Popular_count.head()

92     13
178    12
108     9
132     9
82      9
Name: Item ID, dtype: int64

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame